posts/Emacs/2015-06-24-Debugging-with-Emacs-and-GDB.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-04 Thu 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Debugging with Emacs and GDB</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="Use GDB from withing Emacs to debug source code."
 />
<meta name="keywords" content="GDB, Emacs, CPP, GUD, Debugger, Debugging" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Debugging with Emacs and GDB</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9fb1f71">Introduction</a></li>
<li><a href="#org67f5393">The GNU poject debugger</a></li>
<li><a href="#orgd08206b">GDB in Emacs</a></li>
<li><a href="#orgaba5fb9">Customize GDB</a></li>
<li><a href="#orgb894a48">Window management</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9fb1f71" class="outline-2">
<h2 id="org9fb1f71">Introduction</h2>
<div class="outline-text-2" id="text-org9fb1f71">
<p>
Erroneous source code can be a nasty issue to tackle.  Print
statements that inform you about the states of variables are handy but
sometimes they are unable to represent the intrinsic structure of the
code.  Debuggers allow you to run your code step by step, display and
watch variables and see what is going on <i>inside</i> another program
while it executes.
</p>
</div>
</div>

<div id="outline-container-org67f5393" class="outline-2">
<h2 id="org67f5393">The GNU poject debugger</h2>
<div class="outline-text-2" id="text-org67f5393">
<p>
Here, we will use the <a href="http://www.gnu.org/software/gdb/">GNU project debugger (GDB)</a>, because it is freely
available, very actively developed and can be used on many operating
systems.  It can
</p>
<ul class="org-ul">
<li>start your program, specifying anything that might affect its behavior;</li>
<li>make your program stop on specified conditions;</li>
<li>examine what has happened, when your program has stopped;</li>
<li>change things in your program, so you can experiment with correcting
the effects of one bug and go on to learn about another.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd08206b" class="outline-2">
<h2 id="orgd08206b">GDB in Emacs</h2>
<div class="outline-text-2" id="text-orgd08206b">
<p>
To debug our program, we will use <b>Emacs</b> and <b>C source code</b>,
although <code>gdb</code> can be used from the command line and can debug many
different languages.
</p>

<p>
A good overview about debugging in Emacs with GDB can be found in the
<a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/GDB-Graphical-Interface.html#GDB-Graphical-Interface">Emacs manual</a>.
</p>

<p>
A short step-by-step guide:
</p>
<ul class="org-ul">
<li><p>
Open and save a new file <code>hello.c</code> with the following contents:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"hello world\n"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span> i=<span style="color: #a45bad;">0</span>;i&lt;<span style="color: #a45bad;">10</span>;++i<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        printf<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"%d \n"</span>,i<span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div></li>

<li>Compile it with <code>M-x compile</code>; enter the command <code>gcc -Wall -g
  hello.c -o hello</code>.  Usually, it is very helpful to compile your
source code with debugging flags (e.g., <code>-g</code> for <code>gcc</code>), so that
nothing is optimized out by the compiler.</li>
<li>Activate the graphical debugging environment with <code>M-x
  gdb-many-windows</code>.</li>
<li>Start the debugger with <code>M-x gdb</code>; enter the command <code>gdb -i=mi
  hello</code>.</li>
</ul>

<p>
From withing the Grand Unified Debugger (GUD) buffer, you can run
(<code>r</code>) the program to its end or to the first break point, start
(<code>start</code>) and run in until the beginning of the main procedure.  You
can execute the program line-by-line (<code>n</code>) or step into functions with
<code>s</code>.
</p>

<p>
Breakpoints can be set from withing the source buffer by clicking on
the fringe or with <code>C-x C-a C-b</code>.
</p>
</div>
</div>

<div id="outline-container-orgaba5fb9" class="outline-2">
<h2 id="orgaba5fb9">Customize GDB</h2>
<div class="outline-text-2" id="text-orgaba5fb9">
<p>
To permanently set the nice GDB user interface layout, put
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #4f97d7;">(</span>setq gdb-many-windows t<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
into your <code>.emacs</code> file.  I have also written a function, that
facilitates the starting of the debugger:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defvar</span> <span style="color: #7590db;">gdb-my-history</span> nil <span style="color: #9f8766;">"History list for dom-gdb-MYPROG."</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">dom-gdb-MYPROG</span> <span style="color: #bc6ec5;">()</span>
  <span style="color: #9f8766;">"Debug MYPROG with `</span><span style="color: #a45bad;">gdb</span><span style="color: #9f8766;">'."</span>
  <span style="color: #bc6ec5;">(</span>interactive<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let*</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>wd <span style="color: #2d9574;">"/path/to/working/directory"</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>pr <span style="color: #2d9574;">"/path/to/executable"</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>dt <span style="color: #2d9574;">"/path/to/datafile"</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>guess <span style="color: #b1951d;">(</span>concat <span style="color: #2d9574;">"gdb -i=mi -cd="</span> wd <span style="color: #2d9574;">" --args "</span> pr <span style="color: #2d9574;">" -s "</span> dt<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>arg <span style="color: #b1951d;">(</span>read-from-minibuffer <span style="color: #2d9574;">"Run gdb (like this): "</span>
                                    guess nil nil 'gdb-my-history<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>gdb arg<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb894a48" class="outline-2">
<h2 id="orgb894a48">Window management</h2>
<div class="outline-text-2" id="text-orgb894a48">
<p>
Upon debugging a program with many source files, GDB displays new
source files in (random?) windows in your Emacs frame.  This is
especially tedious if you use <code>gdb-many-windows</code>.  I have written a
function <code>dom-gdb-restore-windows</code>, that resets the display and fixes
the window layout:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">dom-gdb-restore-windows</span> <span style="color: #bc6ec5;">()</span>
  <span style="color: #9f8766;">"Restore GDB session."</span>
  <span style="color: #bc6ec5;">(</span>interactive<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>eq gdb-many-windows t<span style="color: #2d9574;">)</span>
      <span style="color: #2d9574;">(</span>gdb-restore-windows<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>dom-gdb-restore-windows-gud-io-and-source<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">dom-gdb-restore-windows-gud-io-and-source</span> <span style="color: #bc6ec5;">()</span>
  <span style="color: #9f8766;">"Restore GUD buffer, IO buffer and source buffer next to each other."</span>
  <span style="color: #bc6ec5;">(</span>interactive<span style="color: #bc6ec5;">)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Select dedicated GUD buffer.</span>
  <span style="color: #bc6ec5;">(</span>switch-to-buffer gud-comint-buffer<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>delete-other-windows<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>set-window-dedicated-p <span style="color: #2d9574;">(</span>get-buffer-window<span style="color: #2d9574;">)</span> t<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #2d9574;">(</span>or gud-last-last-frame gdb-show-main<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>side-win <span style="color: #4f97d7;">(</span>split-window nil nil t<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
          <span style="color: #b1951d;">(</span>bottom-win <span style="color: #4f97d7;">(</span>split-window<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
      <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Put source to the right.</span>
      <span style="color: #67b11d;">(</span>set-window-buffer
       side-win
       <span style="color: #b1951d;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> gud-last-last-frame
           <span style="color: #4f97d7;">(</span>gud-find-file <span style="color: #bc6ec5;">(</span>car gud-last-last-frame<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
         <span style="color: #4f97d7;">(</span>gud-find-file gdb-main-file<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>setq gdb-source-window side-win<span style="color: #67b11d;">)</span>
      <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Show dedicated IO buffer below.</span>
      <span style="color: #67b11d;">(</span>set-window-buffer
       bottom-win
       <span style="color: #b1951d;">(</span>gdb-get-buffer-create 'gdb-inferior-io<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>set-window-dedicated-p bottom-win t<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">dom-gdb-display-source-buffer</span> <span style="color: #bc6ec5;">()</span>
  <span style="color: #9f8766;">"Display gdb source buffer if it is set."</span>
  <span style="color: #bc6ec5;">(</span>interactive<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #2d9574;">(</span>or gud-last-last-frame gdb-show-main<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>switch-to-buffer
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> gud-last-last-frame
         <span style="color: #b1951d;">(</span>gud-find-file <span style="color: #4f97d7;">(</span>car gud-last-last-frame<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
       <span style="color: #b1951d;">(</span>gud-find-file gdb-main-file<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>delete-other-windows<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(Debugging with Emacs and GDB)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><p>Copyright 2015-2018 Dominik Schrempf</p>
<p>Last updated <span class="timestamp-wrapper"><span class="timestamp">2018-01-04</span></span></p>
<p>Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.1.6) </p>
<p><a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML</p>
</div>
</div>
</body>
</html>
